ProgessBase/Documents/ис_ПереносОтложенныхЗатратМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ис_ПереносОтложенныхЗатратМеждународныйУчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗатратыМеждународныйУчет</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводствоМеждународныйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ис_РасходыБудущихПериодовМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проводки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЖурнала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйДокумент</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйНомерСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НЗП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХарактерЗатрат</v8:Type>
								<v8:Type>cfg:CatalogRef.СпособыРаспределенияЗатратНаВыпуск</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПервичныйНомерСтроки</Name>
					<Comment>Необходим для переноса затрат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ис_РасходыБудущихПериодовМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ис_РасходыБудущихПериодовМеждународныйУчет</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Documents/ис_ПереносОтложенныхЗатратМеждународныйУчет/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого лСтрокаПроводки Из Проводки Цикл 
		
		лОтбор = Новый Структура("СчетКт, СубконтоКт1, СубконтоКт2, СубконтоКт3");
		ЗаполнитьЗначенияСвойств(лОтбор, лСтрокаПроводки);
		лНЗППроводки = НЗП.НайтиСтроки(лОтбор);
		
		лСтоимостьНЗП = 0;
		Для Каждого лСтрокаНЗП Из лНЗППроводки Цикл 
			лСтоимостьНЗП = лСтоимостьНЗП + лСтрокаНЗП.Стоимость;
		КонецЦикла;
		
		Если лНЗППроводки.Количество() > 0 Тогда 
			Если лСтрокаПроводки.Сумма <> лСтоимостьНЗП Тогда 
				//Отказ = Истина;
				Сообщить("В строке №"+лСтрокаПроводки.НомерСтроки+" отличаются сумма строки и НЗП", СтатусСообщения.Внимание);
			КонецЕсли;
		КонецЕсли;
		
		// Проводка
		лПроводка = Движения.Международный.Добавить();
		лПроводка.Период = лСтрокаПроводки.Период;
		лПроводка.Организация = Организация;
		лПроводка.Сумма = лСтрокаПроводки.Сумма;
		лПроводка.Содержание = лСтрокаПроводки.Содержание;
		лПроводка.НомерЖурнала = лСтрокаПроводки.НомерЖурнала;
		лПроводка.ПервичныйДокумент = лСтрокаПроводки.ПервичныйДокумент;
		лПроводка.ис_ПервичныйНомерСтроки = лСтрокаПроводки.ПервичныйНомерСтроки;
		// Дт
		лПроводка.СчетДт = лСтрокаПроводки.СчетДт;
		Для лНомерСубконто=1 По лПроводка.СчетДт.ВидыСубконто.Количество() Цикл 
			БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетДт, лПроводка.СубконтоДт, лНомерСубконто, лСтрокаПроводки["СубконтоДт"+лНомерСубконто]);
		КонецЦикла;
		// Кт
		лПроводка.СчетКт = лСтрокаПроводки.СчетКт;
		Для лНомерСубконто=1 По лПроводка.СчетКт.ВидыСубконто.Количество() Цикл 
			БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетКт, лПроводка.СубконтоКт, лНомерСубконто, лСтрокаПроводки["СубконтоКт"+лНомерСубконто]);
		КонецЦикла;
		
		// Определение значений 
		лРасходыБудущихПериодов = Справочники.РасходыБудущихПериодов.ПустаяСсылка();
		Для лНомерСубконто=1 По лСтрокаПроводки.СчетДт.ВидыСубконто.Количество() Цикл 
			лЗначениеСубконто = лСтрокаПроводки["СубконтоДт"+лНомерСубконто];
			Если ТипЗнч(лЗначениеСубконто) = Тип("СправочникСсылка.РасходыБудущихПериодов") Тогда 
				лРасходыБудущихПериодов = лЗначениеСубконто;
			КонецЕсли;
		КонецЦикла;
		лПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		лНоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
		лСтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка();
		Для лНомерСубконто=1 По лСтрокаПроводки.СчетКт.ВидыСубконто.Количество() Цикл 
			лЗначениеСубконто = лСтрокаПроводки["СубконтоКт"+лНомерСубконто];
			Если ТипЗнч(лЗначениеСубконто) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 
				лПодразделение = лЗначениеСубконто;
			ИначеЕсли ТипЗнч(лЗначениеСубконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда 
				лНоменклатурнаяГруппа = лЗначениеСубконто;
			ИначеЕсли ТипЗнч(лЗначениеСубконто) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда 
				лСтатьяЗатрат = лЗначениеСубконто;
			КонецЕсли;
		КонецЦикла;
		
		// Движения по РБП
		Если ЗначениеЗаполнено(лРасходыБудущихПериодов) Тогда 
			лРасходыБудущихПериодов = ис_Международный.ПолучитьЭлементРБП(Организация, лПодразделение, лНоменклатурнаяГруппа, лСтатьяЗатрат, Истина, лРасходыБудущихПериодов);
			лДвижение = Движения.ис_РасходыБудущихПериодовМеждународныйУчет.Добавить();
			лДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			лДвижение.Период = лСтрокаПроводки.Период;
			лДвижение.Организация = Организация;
			лДвижение.Подразделение = лПодразделение;
			лДвижение.НоменклатурнаяГруппа = лНоменклатурнаяГруппа;
			лДвижение.СтатьяЗатрат = лСтатьяЗатрат;
			лДвижение.Сумма = лСтрокаПроводки.Сумма;
		КонецЕсли;
		
		// Движение по регистру накопления
		лИмяРегистра = ис_Международный.ПолучитьРегистрПоСчетуЗатрат(лСтрокаПроводки.СчетКт);
		Если лИмяРегистра = "НезавершенноеПроизводствоМеждународныйУчет" Тогда 
			
			Если лНЗППроводки.Количество() > 0 Тогда 
				Для Каждого лСтрокаНЗП Из лНЗППроводки Цикл 
					лДвижение = Движения.НезавершенноеПроизводствоМеждународныйУчет.Добавить();
					лДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
					лДвижение.Период = лСтрокаПроводки.Период;
					лДвижение.Организация = Организация;
					лДвижение.Подразделение = лПодразделение;
					лДвижение.НоменклатурнаяГруппа = лНоменклатурнаяГруппа;
					лДвижение.СтатьяЗатрат = лСтатьяЗатрат;
					лДвижение.СчетУчета = лСтрокаПроводки.СчетКт;
					лДвижение.Затрата = лСтрокаНЗП.Затрата;
					лДвижение.Количество = лСтрокаНЗП.Количество;
					лДвижение.Стоимость = лСтрокаНЗП.Стоимость;
				КонецЦикла;
			Иначе
				лДвижение = Движения.НезавершенноеПроизводствоМеждународныйУчет.Добавить();
				лДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
				лДвижение.Период = лСтрокаПроводки.Период;
				лДвижение.Организация = Организация;
				лДвижение.Подразделение = лПодразделение;
				лДвижение.НоменклатурнаяГруппа = лНоменклатурнаяГруппа;
				лДвижение.СтатьяЗатрат = лСтатьяЗатрат;
				лДвижение.СчетУчета = лСтрокаПроводки.СчетКт;
				лДвижение.Стоимость = лСтрокаПроводки.Сумма;
			КонецЕсли;
			
		ИначеЕсли лИмяРегистра = "ЗатратыМеждународныйУчет" Тогда 
			
			лДвижение = Движения.ЗатратыМеждународныйУчет.Добавить();
			лДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
			лДвижение.Период = лСтрокаПроводки.Период;
			лДвижение.Организация = Организация;
			лДвижение.Подразделение = лПодразделение;
			лДвижение.НоменклатурнаяГруппа = лНоменклатурнаяГруппа;
			лДвижение.СтатьяЗатрат = лСтатьяЗатрат;
			лДвижение.СчетУчета = лСтрокаПроводки.СчетКт;
			лДвижение.Сумма = лСтрокаПроводки.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
